magento/magento-connector/magento-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/soapRequests/magento/api_addCommentToShipment_negative.xml

<soapenv:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="urn:Magento">
   <soapenv:Header/>
   <soapenv:Body>
      <urn:salesOrderShipmentAddComment soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
         <sessionId xsi:type="xsd:string">%s(sessionId)</sessionId>
         <shipmentIncrementId xsi:type="xsd:string">invalid</shipmentIncrementId>
         <comment xsi:type="xsd:string"></comment>
         <email xsi:type="xsd:string"></email>
         <includeInEmail xsi:type="xsd:string"></includeInEmail>
      </urn:salesOrderShipmentAddComment>
   </soapenv:Body>
</soapenv:Envelope>